docs: V4 documentation updates.
